# Data Wrangling

Let's keep going through how to use Pandas for processing our data.

In [10]:
import pandas as pd

data_dir = "/Users/delre/python/data"
csv = data_dir + "/boston_precip_temp.csv"

df = pd.read_csv(csv)

## Manipulate data

### Subset by row

Sometimes, we want to create a subset of the main data frame based on certain conditions. We do this by using `df.loc` and specifying a condition for the rows. 

Below, we take all of the rows where `temp` is greater or equal to 50 with `df['temp'] >= temp` and assign this to a new data frame.

To check that this was done correctly, we can look at the minimum of the `temp` column in the new data frame with `.min()`.

In [11]:
df_50 = df.loc[df['temp'] >= 50, :]
print(df_50['temp'].min())
df_50.shape
#first part of the code up until "50 ,:" generates a full column's worth of Booleans

50.0

(134, 7)

We can also subset with categorical variables. Here, we take all rows where the station name is `NORWOOD MEMORIAL AIRPORT, MA US`.

In [ ]:
# NORWOOD MEMORIAL AIRPORT, MA US

array(['NORWOOD MEMORIAL AIRPORT, MA US'], dtype=object)

Importantly, we can use subsetting to remove rows with improper values.

In [12]:
df['snow-totals'].describe

<bound method NDFrame.describe of 0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
        ...
295       0.0
296       0.0
297   -7777.0
298       1.5
299       9.7
Name: snow-totals, Length: 300, dtype: float64>

We can provide multiple conditions at the same time as well, but we have to use different operators instead of `and` and `or`. Instead we use `&` and `|`.

In [ ]:
# and

In [ ]:
### code below:

In [ ]:
# or

### Question

What is the mean temperaure recorded across all stations in the month of July (7th month) when total precipitation is greater than 3.5?

You may have noticed when we do these subsets, the row numbers actually do not reset. We have to manually do this with `.reset_index()`

In [14]:
df_sub = df.loc[(df['name']=='NORWOOD MEMORIAL AIRPORT, MA US') | (df['temp']>=50), :]

df_sub.reset_index()

,index,station,name,date,temp,diurnal_temp_range,precip-total,snow-totals
0,0,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",1,25.9,19.7,3.43,NaN
1,1,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",2,28.9,21.0,3.25,NaN
2,2,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",3,36.4,21.5,4.45,NaN
3,3,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",4,46.8,22.7,4.19,NaN
4,4,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",5,56.4,24.9,3.68,NaN
...,...,...,...,...,...,...,...,...
136,293,USC00195984,"NORTON, MA US",6,66.0,24.1,3.97,0.0
137,294,USC00195984,"NORTON, MA US",7,71.8,22.4,3.81,0.0
138,295,USC00195984,"NORTON, MA US",8,69.9,23.1,4.04,0.0
139,296,USC00195984,"NORTON, MA US",9,61.8,23.9,3.99,0.0
140,297,USC00195984,"NORTON, MA US",10,50.6,22.8,4.39,-7777.0

If you do not want to save the old row numbers, you can the argument `drop=True`.

In [15]:
# drop = True
df_sub.reset_index(drop=True)

,station,name,date,temp,diurnal_temp_range,precip-total,snow-totals
0,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",1,25.9,19.7,3.43,NaN
1,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",2,28.9,21.0,3.25,NaN
2,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",3,36.4,21.5,4.45,NaN
3,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",4,46.8,22.7,4.19,NaN
4,USW00054704,"NORWOOD MEMORIAL AIRPORT, MA US",5,56.4,24.9,3.68,NaN
...,...,...,...,...,...,...,...
136,USC00195984,"NORTON, MA US",6,66.0,24.1,3.97,0.0
137,USC00195984,"NORTON, MA US",7,71.8,22.4,3.81,0.0
138,USC00195984,"NORTON, MA US",8,69.9,23.1,4.04,0.0
139,USC00195984,"NORTON, MA US",9,61.8,23.9,3.99,0.0
140,USC00195984,"NORTON, MA US",10,50.6,22.8,4.39,-7777.0

Conditions are one way to limit our data set to proper and non-missing values.

In [16]:
#NaN = Not a Number (default to show in dataframes)

import numpy as np
df.loc[(df['snow-totals']>=0) & (df['snow-totals'] != np.NaN),:].reset_index(drop=True)

df.loc[(df['snow-totals']>=0) & (df['snow-totals'].notnull()),:].reset_index(drop=True)

,station,name,date,temp,diurnal_temp_range,precip-total,snow-totals
0,USC00195175,"NATICK, MA US",1,25.2,18.8,3.45,13.7
1,USC00195175,"NATICK, MA US",2,28.5,19.5,3.18,9.1
2,USC00195175,"NATICK, MA US",3,35.9,20.9,4.08,7.0
3,USC00195175,"NATICK, MA US",4,46.5,22.8,4.10,2.4
4,USC00195175,"NATICK, MA US",5,56.8,22.3,3.91,0.0
...,...,...,...,...,...,...,...
166,USC00195984,"NORTON, MA US",7,71.8,22.4,3.81,0.0
167,USC00195984,"NORTON, MA US",8,69.9,23.1,4.04,0.0
168,USC00195984,"NORTON, MA US",9,61.8,23.9,3.99,0.0
169,USC00195984,"NORTON, MA US",11,42.0,20.8,4.79,1.5
170,USC00195984,"NORTON, MA US",12,31.8,20.0,4.74,9.7

### Question:
Below is a dictionary where the keys are station names, and the values are the zip codes for the station names. Creating a new data frame, replace the values in the `name` column with their corresponding zip codes.

*Hint - Use a for loop.*

In [19]:
zip_codes = {
    'BEDFORD HANSCOM FIELD, MA US': '01731',
    'BEVERLY MUNICIPAL AIRPORT, MA US': '01915',
    'BEVERLY, MA US': '01915',
    'BLUE HILL LCD, MA US': '02191',
    'BOSTON, MA US': '02108',
    'BRIDGEWATER, MA US': '02324',
    'BROCKTON, MA US': '02301',
    'FRANKLIN, MA US': '02038',
    'GROVELAND, MA US': '01834',
    'HAVERHILL, MA US': '01830',
    'HINGHAM, MA US': '02043',
    'JAMAICA PLAIN, MA US': '02130',
    'LAWRENCE MUNICIPAL AIRPORT, MA US': '01841',
    'LAWRENCE, MA US': '01841',
    'LOWELL, MA US': '01852',
    'MARBLEHEAD, MA US': '01945',
    'MAYNARD, MA US': '01754',
    'MIDDLETON, MA US': '01949',
    'MILFORD, MA US': '01757',
    'NATICK, MA US': '01760',
    'NORTON, MA US': '02766',
    'NORWOOD MEMORIAL AIRPORT, MA US': '02062',
    'READING, MA US': '01867',
    'SOUTH WEYMOUTH NAS, MA US': '02190',
    'WALPOLE 2, MA US': '02081',
}

# your code here:

df2 = df #new data frame pointing directly at old

for name, zip_code in zip_codes.items(): #for loop over all of the items in zip codes - name 
    #grabs the name of the station (values) and zip_code gets the zip codes (keys)
    df2['name'].replace(name, zip_code)

df2.name

0      NORWOOD MEMORIAL AIRPORT, MA US
1      NORWOOD MEMORIAL AIRPORT, MA US
2      NORWOOD MEMORIAL AIRPORT, MA US
3      NORWOOD MEMORIAL AIRPORT, MA US
4      NORWOOD MEMORIAL AIRPORT, MA US
                    ...
295                      NORTON, MA US
296                      NORTON, MA US
297                      NORTON, MA US
298                      NORTON, MA US
299                      NORTON, MA US
Name: name, Length: 300, dtype: object

### Replacing values

In [17]:
import numpy as np

df['snow-totals'].replace(-7777., np.NaN)

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
      ...
295    0.0
296    0.0
297    NaN
298    1.5
299    9.7
Name: snow-totals, Length: 300, dtype: float64

## Any and all

`any()` and `all()` are functions built into Pandas data frames and columns. They let us check if any of the values are `True`, or of all the values are `True`, respectively.

In [13]:
# any

True

In [ ]:
# all

We can use these functions to see if any rows or columns are missing any data.

In [4]:
# check all values in data frame

In [5]:
# check all columns

In [ ]:
# check all rows

In [18]:
# how many rows are missing data?

144

We can also use `.any()` to get back a data frame with only rows with missing values, or (more helpfully), only rows without missing values.

In [ ]:
# only missing

In [ ]:
# only not missing

### Sort data frame

To sort the rows in a data frame by the value of a column, we can use the `.sort_values()` method. The argument `by` requires a list with a column name. 

Again, if you want to use the sorted version in the future, you need to save it as a new variable.

In [21]:
my_dict = {
    'a': [1, 3, 5],
    'b': ['apple', 'banana', 'apple'],
    'c': [-2., -3., -5.]
}

my_df = pd.DataFrame(my_dict)

# sort by column b

   a       b    c
0  1   apple -2.0
2  5   apple -5.0
1  3  banana -3.0

You can also sort descending by specifying the `ascending=False` argument.

In [6]:
# sort ascending

If desired, multiple column names can be specified, with priority given to those first in the list.

In [7]:
# multi column sort

### Add rows
There are multiple ways to add a new row to a data frame. The most straightforward way is to use the `pandas.concat()` function with a new data frame with just one row. 

We put the the two data frames into a list, and we set `axis=0` to make sure it adds as a row. We will specify `.reset_index(drop=True)` to reset row numbers to account for the new row.

You can also use this approach to add multiple rows, as well, by having the new data frame consist of multiple rows.

### Question
Add a new row to the Boston precipitation and temperature data.

In [26]:
### code here:

### Join data frames
A critical tool in data wrangling is combining data frames that share common values, columns, or identifiers.

Let's important two new .csv files and join them.

In [27]:
surveys_df = pd.read_csv(data_dir+"surveys.csv", keep_default_na=False, na_values=[""])
species_df = pd.read_csv(data_dir+"species.csv", keep_default_na=False, na_values=[""])

print(surveys_df.head())
print(species_df.head())

   record_id  month  day  year  plot_id species_id sex  hindfoot_length  \
0          1      7   16  1977        2         NL   M             32.0
1          2      7   16  1977        3         NL   M             33.0
2          3      7   16  1977        2         DM   F             37.0
3          4      7   16  1977        7         DM   M             36.0
4          5      7   16  1977        3         DM   M             35.0

   weight
0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
  species_id             genus          species    taxa
0         AB        Amphispiza        bilineata    Bird
1         AH  Ammospermophilus          harrisi  Rodent
2         AS        Ammodramus       savannarum    Bird
3         BA           Baiomys          taylori  Rodent
4         CB   Campylorhynchus  brunneicapillus    Bird

The shared column between these data frames is `species_id`, so this is the column we will want to join around.

#### Inner Join
The pandas function for performing joins is called `merge()` and an Inner join is the default option.

Inner joins take all rows from both data frames that share values from an identifier column. In our case, this means that our joined data frame will only include rows with species identifiers present in `species_df` and `surveys_df`.

<img src="https://datacarpentry.org/python-ecology-lesson/fig/inner-join.png" alt="inner join" width=250px>

In [8]:


# In this case `species_id` is the only column name in  both dataframes, so if we skipped `left_on`
# And `right_on` arguments we would still get the same result

# What's the size of the output data?

The result `merged_inner` data frame contains all of the columns from `surveys_df` (`record_id`, `month`, `day`, etc.) as well as all the columns from `species_df` (`species_id`, `genus`, `species`, and `taxa`).

#### Left join

What if we want to add information from `species_df` to `surveys_df`without losing any of the information from `surveys_df`? In this case, we use a different type of join called a left join, where we keep all rows from the data frame we call left (in our case `surveys_df`) and only take rows from the right data frame (`species_df`) with species IDs in `surveys_df`.

<img src="https://datacarpentry.org/python-ecology-lesson/fig/left-join.png" alt="left join" width=250px>

A left join is performed in pandas by calling the same `merge()` function used for inner join, but using the `how='left'` argument.

### Question

Compare the two types of joins. Which type of join results in more rows with missing data? Can you think of situations where one type of join might be more useful than the other?

## Working with dates

In the Boston precipitation and temperature data, time is labeled as a number standing for month. This is relatively straight forward to handle.

Often, data sheets contain dates in formats that you will need to process before using. For instance, a single column might contain year, month, day and time of day information.

Here, we use data on net emissions by country, which has severl columns with dates and times.

In [30]:
emissions_path = data_dir + "country_net-grassland-emissions.csv"

emissions = pd.read_csv(emissions_path)
emissions.head()

,iso3_country,start_time,end_time,original_inventory_sector,gas,emissions_quantity,emissions_quantity_units,temporal_granularity,created_date,modified_date
0,AFG,2021-01-01 00:00:00,2021-12-31 00:00:00,net-grassland-emissions,co2,4.035921e+06,tonnes,annual,2022-10-10 17:13:05.115568,2022-10-24 16:24:04.711642
1,AFG,2021-01-01 00:00:00,2021-12-31 00:00:00,net-grassland-emissions,co2e_100yr,4.035921e+06,tonnes,annual,2022-10-10 17:13:05.115599,2022-10-24 16:24:04.711642
2,AFG,2021-01-01 00:00:00,2021-12-31 00:00:00,net-grassland-emissions,co2e_20yr,4.035921e+06,tonnes,annual,2022-10-10 17:13:05.115604,2022-10-24 16:24:04.711642
3,AGO,2021-01-01 00:00:00,2021-12-31 00:00:00,net-grassland-emissions,co2,-1.348266e+08,tonnes,annual,2022-10-10 17:13:05.115709,2022-10-24 16:24:04.711642
4,AGO,2021-01-01 00:00:00,2021-12-31 00:00:00,net-grassland-emissions,co2e_100yr,-1.348266e+08,tonnes,annual,2022-10-10 17:13:05.115727,2022-10-24 16:24:04.711642

These columns with dates are all objects. That is to say, right now the dates are all strings, which can be difficult to work with at times.

In [31]:
# get dtypes

iso3_country                  object
start_time                    object
end_time                      object
original_inventory_sector     object
gas                           object
emissions_quantity           float64
emissions_quantity_units      object
temporal_granularity          object
created_date                  object
modified_date                 object
dtype: object

To convert the column into a more useful data type, we can use the pandas function `pd.to_datetime()` to convert to a `datatype` format.

In [ ]:
# to_datetime()

`to_datetime()` makes some assumptions about order of month and year, so it can be a good idea to tell it the format we are working with the `format` parameter, which takes a string.

We can use identifiers to match up the components of date and time:
-`'%Y'` year (4 digits) or `'%y'` year (2 digits)
-`'%m'` month
-`'%d'` day
-`'%H'` hour
-`'%M'` minute
-`'%S'` second

You'll want to check the order these components are found in your column, as well as if there are characters between them.

For us, the year comes first, followed by month and then day. Then comes hour, minute, and second. The date components are separated by dashes, the time components have colons, and there is a space between date and time.

In [33]:
# add format

0      2021-01-01
1      2021-01-01
2      2021-01-01
3      2021-01-01
4      2021-01-01
          ...
8745   2015-01-01
8746   2015-01-01
8747   2015-01-01
8748   2015-01-01
8749   2015-01-01
Name: start_time, Length: 8750, dtype: datetime64[ns]

We can then reassign the date column to be a useful data type.

Once we do that, we can pull out parts of the date as we need them using `.dt.strftime()`, specifying the component(s) of the date we would like.

In [12]:
emissions['start_time'] = pd.to_datetime(emissions.start_time, format="%Y-%m-%d %H:%M:%S")

We can very specifically ask for different formats back.

In [13]:
emissions['start_time'].dt.strftime(  )

### Question
Using the emissions data set and the `end_time` and `emissions_quantity` columns, print out the mean `emissions_quantity` for each year.

In [ ]:
# your code here